app/controllers/places_controller.rb

SELECT  "places".* FROM "places"  WHERE "places"."name" = 'The Great Pyramid of Giza' LIMIT 1
---
  def show
    @place = Place.find_by(:name => params[:id])

SELECT  "places".* FROM "places"  WHERE "places"."name" = 'Colossus of Rhodes' LIMIT 1
DELETE FROM "places" WHERE "places"."id" = 50
---
  def delete
    @place = Place.find_by(:name => params[:id])
    @place.delete

INSERT INTO "places" ("admis_price", "description", "name", "url", "w_type") VALUES (?, ?, ?, ?, ?)
---
  def create
    Place.create(name: params[:name], url: params[:url], w_type: params[:type], admis_price: params[:price], description: params[:description] )

SELECT  "places".* FROM "places"  WHERE "places"."name" = 'The Great Pyramid of Giza' LIMIT 1
---
  def edit
    @place = Place.find_by(:name => params[:id])

SELECT  "places".* FROM "places"  WHERE "places"."name" = 'The Great Pyramid of Giza' LIMIT 1
UPDATE "places" SET "admis_price" = ?, "url" = ? WHERE "places"."id" = 112  [["admis_price", 14], ["url", "https://upload.wikimedia.org/wikipedia/commons/c/c7/Puppy_on_Halong_Bay.jpg"]]
---
  def update
    current = Place.find_by(:name => params[:id])
    current.url = params[:url]
    current.name = params[:name]
    current.description = params[:description]
    current.admis_price = params[:price]
    current.w_type = params[:type]
    current.save