app/views/places/index.html.erb


  <% Place.types.each do |type| %>
---
SELECT "places".* FROM "places"